In [4]:
edges = 'edges.csv'
hero_network = 'hero-network.csv'
nodes = 'nodes.csv'

In [5]:
import pandas as pd
import lib_2

In [6]:
data_edges = pd.read_csv(edges)

In [7]:
data_edges

                       hero     comic
0      24-HOUR MAN/EMMANUEL    AA2 35
1      3-D MAN/CHARLES CHAN     AVF 4
2      3-D MAN/CHARLES CHAN     AVF 5
3      3-D MAN/CHARLES CHAN     COC 1
4      3-D MAN/CHARLES CHAN    H2 251
...                     ...       ...
96099                 ZZZAX    H2 326
96100                 ZZZAX    H2 327
96101                 ZZZAX  M/CP 8/4
96102                 ZZZAX     PM 47
96103                 ZZZAX   WCA2 12

[96104 rows x 2 columns]

In [8]:
data_hero_network = pd.read_csv(hero_network)

In [9]:
data_hero_network

                       hero1                 hero2
0              LITTLE, ABNER        PRINCESS ZANDA
1              LITTLE, ABNER  BLACK PANTHER/T'CHAL
2       BLACK PANTHER/T'CHAL        PRINCESS ZANDA
3              LITTLE, ABNER        PRINCESS ZANDA
4              LITTLE, ABNER  BLACK PANTHER/T'CHAL
...                      ...                   ...
574462  COLOSSUS II/PETER RA              CALLISTO
574463              CALLISTO               ROGUE /
574464              CALLISTO              CALIBAN/
574465              CALIBAN/               ROGUE /
574466  HULK/DR. ROBERT BRUC     MARKS, DR. SHIELA

[574467 rows x 2 columns]

In [10]:
data_nodes = pd.read_csv(nodes)

In [11]:
data_nodes

                       node   type
0                   2001 10  comic
1                    2001 8  comic
2                    2001 9  comic
3      24-HOUR MAN/EMMANUEL   hero
4      3-D MAN/CHARLES CHAN   hero
...                     ...    ...
19085           ZOTA, CARLO   hero
19086                  ZOTA   hero
19087                 ZURAS   hero
19088                  ZURI   hero
19089                 ZZZAX   hero

[19090 rows x 2 columns]

In [12]:
lib_2.eda_base(data_edges)

                   hero   comic
0  24-HOUR MAN/EMMANUEL  AA2 35
1  3-D MAN/CHARLES CHAN   AVF 4
2  3-D MAN/CHARLES CHAN   AVF 5
3  3-D MAN/CHARLES CHAN   COC 1
4  3-D MAN/CHARLES CHAN  H2 251

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96104 entries, 0 to 96103
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   hero    96104 non-null  object
 1   comic   96104 non-null  object
dtypes: object(2)
memory usage: 1.5+ MB

None

Shape (96104, 2)

                           hero  comic
count                     96104  96104
unique                     6439  12651
top     SPIDER-MAN/PETER PARKER  COC 1
freq                       1577    111

isNa? 0
Duplicates? 0

In [13]:
lib_2.eda_base(data_hero_network)

                  hero1                 hero2
0         LITTLE, ABNER        PRINCESS ZANDA
1         LITTLE, ABNER  BLACK PANTHER/T'CHAL
2  BLACK PANTHER/T'CHAL        PRINCESS ZANDA
3         LITTLE, ABNER        PRINCESS ZANDA
4         LITTLE, ABNER  BLACK PANTHER/T'CHAL

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 574467 entries, 0 to 574466
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   hero1   574467 non-null  object
 1   hero2   574467 non-null  object
dtypes: object(2)
memory usage: 8.8+ MB

None

Shape (574467, 2)

                  hero1            hero2
count            574467           574467
unique             6211             6173
top     CAPTAIN AMERICA  CAPTAIN AMERICA
freq               8149             8350

isNa? 0
Duplicates? 350286

In [14]:
lib_2.eda_base(data_nodes)

                   node   type
0               2001 10  comic
1                2001 8  comic
2                2001 9  comic
3  24-HOUR MAN/EMMANUEL   hero
4  3-D MAN/CHARLES CHAN   hero

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19090 entries, 0 to 19089
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   node    19090 non-null  object
 1   type    19090 non-null  object
dtypes: object(2)
memory usage: 298.4+ KB

None

Shape (19090, 2)

           node   type
count     19090  19090
unique    19090      2
top     2001 10  comic
freq          1  12651

isNa? 0
Duplicates? 0

In [15]:
df_nodes = pd.DataFrame(data_nodes)
df_hero_network = pd.DataFrame(data_hero_network)
df_edges = pd.DataFrame(data_edges)

In [16]:
df_nodes_origin = df_nodes.copy()
df_hero_network_origin = df_hero_network.copy()
df_edges_origin = df_edges.copy()

In [115]:
df_nodes.values

array([['2001 10', 'comic'],
       ['2001 8', 'comic'],
       ['2001 9', 'comic'],
       ...,
       ['ZURAS', 'hero'],
       ['ZURI', 'hero'],
       ['ZZZAX', 'hero']], dtype=object)

In [18]:
df_hero_network.values

array([['LITTLE, ABNER', 'PRINCESS ZANDA'],
       ['LITTLE, ABNER', "BLACK PANTHER/T'CHAL"],
       ["BLACK PANTHER/T'CHAL", 'PRINCESS ZANDA'],
       ...,
       ['CALLISTO', 'CALIBAN/'],
       ['CALIBAN/', 'ROGUE /'],
       ['HULK/DR. ROBERT BRUC', 'MARKS, DR. SHIELA']], dtype=object)

In [19]:
df_edges.values

array([['24-HOUR MAN/EMMANUEL', 'AA2 35'],
       ['3-D MAN/CHARLES CHAN', 'AVF 4'],
       ['3-D MAN/CHARLES CHAN', 'AVF 5'],
       ...,
       ['ZZZAX', 'M/CP 8/4'],
       ['ZZZAX', 'PM 47'],
       ['ZZZAX', 'WCA2 12']], dtype=object)

In [20]:
#question 1

### Nodes

In [52]:
df_nodes.head(4)

                   node   type
0               2001 10  comic
1                2001 8  comic
2                2001 9  comic
3  24-HOUR MAN/EMMANUEL   hero

In [195]:
save = df_nodes.groupby(['type'],as_index=False).count()
save

    type   node
0  comic  12651
1   hero   6439

In [97]:
df_nodes[df_nodes['type'] == 'comic'].value_counts()

node         type
2001 10      comic    1
PPTSS 246    comic    1
PPTSS 248    comic    1
PPTSS 249    comic    1
PPTSS 25     comic    1
                     ..
FMON 9       comic    1
FOOL 1       comic    1
FOOL 10      comic    1
FOOL 2       comic    1
rse powers.  comic    1
Length: 12651, dtype: int64

In [113]:
column = 'node'
df_nodes[column].value_counts()

2001 10          1
PPTSS 235        1
PPTSS 233        1
PPTSS 232        1
PPTSS 231        1
                ..
GATES, JUNIOR    1
GATECRASHER      1
GARVIN, GEARS    1
GAR-TOOM         1
ZZZAX            1
Name: node, Length: 19090, dtype: int64

# Hero network

In [53]:
df_hero_network.head(4)

                  hero1                 hero2
0         LITTLE, ABNER        PRINCESS ZANDA
1         LITTLE, ABNER  BLACK PANTHER/T'CHAL
2  BLACK PANTHER/T'CHAL        PRINCESS ZANDA
3         LITTLE, ABNER        PRINCESS ZANDA

### The most popular hero in terms of network

In [187]:
column = 'hero1'
most_popular_hero_network = df_hero_network[[column]].value_counts()
mp_df = pd.DataFrame(most_popular_hero_network)
mp_df

hero1
CAPTAIN AMERICA         8149
SPIDER-MAN/PETER PAR    6652
IRON MAN/TONY STARK     5850
THOR/DR. DONALD BLAK    5712
THING/BENJAMIN J. GR    5369
                        ...
TREVORIK                   1
AZRAEL                     1
MANTLO, BILL               1
SYLPH                      1
SNIPER/VON BURIAN          1
Length: 6211, dtype: int64

In [211]:
# most_popular_hero_network[5000]
df_hero_network[df_hero_network['hero1'] == 'CAPTAIN AMERICA']

                  hero1                 hero2
2854    CAPTAIN AMERICA  THOR/DR. DONALD BLAK
2855    CAPTAIN AMERICA  IRON MAN/TONY STARK
2856    CAPTAIN AMERICA  SILVER SURFER/NORRIN
2857    CAPTAIN AMERICA  MOLECULE MAN/OWEN RE
2864    CAPTAIN AMERICA       SOUTHERN, CANDY
...                 ...                   ...
574383  CAPTAIN AMERICA  CANNONBALL II/SAM GU
574384  CAPTAIN AMERICA  WOLFSBANE/RAHNE SINC
574385  CAPTAIN AMERICA  MAGMA/AMARA AQUILLA/
574386  CAPTAIN AMERICA  SCARLET WITCH/WANDA
574387  CAPTAIN AMERICA  MAGIK/ILLYANA RASPUT

[8149 rows x 2 columns]

# Edges

In [54]:
df_edges.head(4)

                   hero   comic
0  24-HOUR MAN/EMMANUEL  AA2 35
1  3-D MAN/CHARLES CHAN   AVF 4
2  3-D MAN/CHARLES CHAN   AVF 5
3  3-D MAN/CHARLES CHAN   COC 1

In [190]:
df_edges[df_edges['comic'] == 'N 37']

                     hero comic
56754  NEPTUNE [OLYMPIAN]  N 37

### The most popular hero in comics (by count)

In [148]:
column = 'hero'
most_popular_hero = df_edges[[column]].value_counts()
most_popular_hero

hero
SPIDER-MAN/PETER PARKER    1577
CAPTAIN AMERICA            1334
IRON MAN/TONY STARK        1150
THING/BENJAMIN J. GR        963
THOR/DR. DONALD BLAK        956
                           ...
LEASH, MICAH                  1
LEATHER/                      1
SERSI | MUTANT X-VER          1
LEE, LITTLE LARRY             1
24-HOUR MAN/EMMANUEL          1
Length: 6439, dtype: int64

### In which comic were the biggest number of heroes?
The most participant comics
Comics with the biggest number of heroes

In [156]:
most_populat_comic = df_edges[['comic']].value_counts()
most_populat_comic

comic
COC 1               111
IW 3                 91
IW 1                 90
H2 279               87
IW 4                 80
                   ...
MYSTIC COMICS 10      1
N 2/4                 1
N 37                  1
N 4/2                 1
rse powers.           1
Length: 12651, dtype: int64

In [ ]:
#question 2

In [ ]:
#question 3

In [ ]:
#qustion 4